app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Biology"], ["room_number", 25]]
---
    def create
        @school_class = SchoolClass.create(school_classes_params)