app/controllers/students_controller.rb

  def update
    find_student
    @student.update(student_params)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Mike"], ["last_name", "Ainsel"], ["updated_at", "2019-11-04 17:31:23.451023"], ["id", 4]]